MikroElektronika/core_packages/PIC32/XC32/def/PIC32MZ2048EFH144/mcu.h
extern volatile __OFF180bits_t OFF180bits __asm__ ("OFF180") __attribute__((section("sfrs"), address(0xBF810810)));
#define OFF181 OFF181
extern volatile uint32_t   OFF181 __attribute__((section("sfrs"), address(0xBF810814)));
typedef struct {
  uint32_t :1;
  uint32_t VOFF:17;
} __OFF181bits_t;
extern volatile __OFF181bits_t OFF181bits __asm__ ("OFF181") __attribute__((section("sfrs"), address(0xBF810814)));
#define OFF182 OFF182
extern volatile uint32_t   OFF182 __attribute__((section("sfrs"), address(0xBF810818)));
typedef struct {
  uint32_t :1;
  uint32_t VOFF:17;
} __OFF182bits_t;
extern volatile __OFF182bits_t OFF182bits __asm__ ("OFF182") __attribute__((section("sfrs"), address(0xBF810818)));
#define OFF183 OFF183
extern volatile uint32_t   OFF183 __attribute__((section("sfrs"), address(0xBF81081C)));
typedef struct {
  uint32_t :1;
  uint32_t VOFF:17;
} __OFF183bits_t;
extern volatile __OFF183bits_t OFF183bits __asm__ ("OFF183") __attribute__((section("sfrs"), address(0xBF81081C)));
#define OFF184 OFF184
extern volatile uint32_t   OFF184 __attribute__((section("sfrs"), address(0xBF810820)));
typedef struct {
  uint32_t :1;
  uint32_t VOFF:17;
} __OFF184bits_t;
extern volatile __OFF184bits_t OFF184bits __asm__ ("OFF184") __attribute__((section("sfrs"), address(0xBF810820)));
#define OFF185 OFF185
extern volatile uint32_t   OFF185 __attribute__((section("sfrs"), address(0xBF810824)));
typedef struct {
  uint32_t :1;
  uint32_t VOFF:17;
} __OFF185bits_t;
extern volatile __OFF185bits_t OFF185bits __asm__ ("OFF185") __attribute__((section("sfrs"), address(0xBF810824)));
#define OFF186 OFF186
extern volatile uint32_t   OFF186 __attribute__((section("sfrs"), address(0xBF810828)));
typedef struct {
  uint32_t :1;
  uint32_t VOFF:17;
} __OFF186bits_t;
extern volatile __OFF186bits_t OFF186bits __asm__ ("OFF186") __attribute__((section("sfrs"), address(0xBF810828)));
#define OFF187 OFF187
extern volatile uint32_t   OFF187 __attribute__((section("sfrs"), address(0xBF81082C)));
typedef struct {
  uint32_t :1;
  uint32_t VOFF:17;
} __OFF187bits_t;
extern volatile __OFF187bits_t OFF187bits __asm__ ("OFF187") __attribute__((section("sfrs"), address(0xBF81082C)));
#define OFF188 OFF188
extern volatile uint32_t   OFF188 __attribute__((section("sfrs"), address(0xBF810830)));
typedef struct {
  uint32_t :1;
  uint32_t VOFF:17;
} __OFF188bits_t;
extern volatile __OFF188bits_t OFF188bits __asm__ ("OFF188") __attribute__((section("sfrs"), address(0xBF810830)));
#define OFF189 OFF189
extern volatile uint32_t   OFF189 __attribute__((section("sfrs"), address(0xBF810834)));
typedef struct {
  uint32_t :1;
  uint32_t VOFF:17;
} __OFF189bits_t;
extern volatile __OFF189bits_t OFF189bits __asm__ ("OFF189") __attribute__((section("sfrs"), address(0xBF810834)));
#define OFF190 OFF190
extern volatile uint32_t   OFF190 __attribute__((section("sfrs"), address(0xBF810838)));
typedef struct {
  uint32_t :1;
  uint32_t VOFF:17;
} __OFF190bits_t;
extern volatile __OFF190bits_t OFF190bits __asm__ ("OFF190") __attribute__((section("sfrs"), address(0xBF810838)));
#define OFF192 OFF192
extern volatile uint32_t   OFF192 __attribute__((section("sfrs"), address(0xBF810840)));
typedef struct {
  uint32_t :1;
  uint32_t VOFF:17;
} __OFF192bits_t;
extern volatile __OFF192bits_t OFF192bits __asm__ ("OFF192") __attribute__((section("sfrs"), address(0xBF810840)));
#define OFF193 OFF193
extern volatile uint32_t   OFF193 __attribute__((section("sfrs"), address(0xBF810844)));
typedef struct {
  uint32_t :1;
  uint32_t VOFF:17;
} __OFF193bits_t;
extern volatile __OFF193bits_t OFF193bits __asm__ ("OFF193") __attribute__((section("sfrs"), address(0xBF810844)));
#define OFF194 OFF194
extern volatile uint32_t   OFF194 __attribute__((section("sfrs"), address(0xBF810848)));
typedef struct {
  uint32_t :1;
  uint32_t VOFF:17;
} __OFF194bits_t;
extern volatile __OFF194bits_t OFF194bits __asm__ ("OFF194") __attribute__((section("sfrs"), address(0xBF810848)));
#define OFF196 OFF196
extern volatile uint32_t   OFF196 __attribute__((section("sfrs"), address(0xBF810850)));
typedef struct {
  uint32_t :1;
  uint32_t VOFF:17;
} __OFF196bits_t;
extern volatile __OFF196bits_t OFF196bits __asm__ ("OFF196") __attribute__((section("sfrs"), address(0xBF810850)));
#define OFF198 OFF198
extern volatile uint32_t   OFF198 __attribute__((section("sfrs"), address(0xBF810858)));
typedef struct {
  uint32_t :1;
  uint32_t VOFF:17;
} __OFF198bits_t;
extern volatile __OFF198bits_t OFF198bits __asm__ ("OFF198") __attribute__((section("sfrs"), address(0xBF810858)));
#define OFF199 OFF199
extern volatile uint32_t   OFF199 __attribute__((section("sfrs"), address(0xBF81085C)));
typedef struct {
  uint32_t :1;
  uint32_t VOFF:17;
} __OFF199bits_t;
extern volatile __OFF199bits_t OFF199bits __asm__ ("OFF199") __attribute__((section("sfrs"), address(0xBF81085C)));
#define OFF200 OFF200
extern volatile uint32_t   OFF200 __attribute__((section("sfrs"), address(0xBF810860)));
typedef struct {
  uint32_t :1;
  uint32_t VOFF:17;
} __OFF200bits_t;
extern volatile __OFF200bits_t OFF200bits __asm__ ("OFF200") __attribute__((section("sfrs"), address(0xBF810860)));
#define OFF201 OFF201
extern volatile uint32_t   OFF201 __attribute__((section("sfrs"), address(0xBF810864)));
typedef struct {
  uint32_t :1;
  uint32_t VOFF:17;
} __OFF201bits_t;
extern volatile __OFF201bits_t OFF201bits __asm__ ("OFF201") __attribute__((section("sfrs"), address(0xBF810864)));
#define OFF202 OFF202
extern volatile uint32_t   OFF202 __attribute__((section("sfrs"), address(0xBF810868)));
typedef struct {
  uint32_t :1;
  uint32_t VOFF:17;
} __OFF202bits_t;
extern volatile __OFF202bits_t OFF202bits __asm__ ("OFF202") __attribute__((section("sfrs"), address(0xBF810868)));
#define OFF205 OFF205
extern volatile uint32_t   OFF205 __attribute__((section("sfrs"), address(0xBF810874)));
typedef struct {
  uint32_t :1;
  uint32_t VOFF:17;
} __OFF205bits_t;
extern volatile __OFF205bits_t OFF205bits __asm__ ("OFF205") __attribute__((section("sfrs"), address(0xBF810874)));
#define OFF206 OFF206
extern volatile uint32_t   OFF206 __attribute__((section("sfrs"), address(0xBF810878)));
typedef struct {
  uint32_t :1;
  uint32_t VOFF:17;
} __OFF206bits_t;
