MikroElektronika/core_packages/PIC32/XC32/def/PIC32MZ2048EFH144/mcu.h
extern volatile __PMAENbits_t PMAENbits __asm__ ("PMAEN") __attribute__((section("sfrs"), address(0xBF82E050)));
extern volatile uint32_t        PMAENCLR __attribute__((section("sfrs"),address(0xBF82E054)));
extern volatile uint32_t        PMAENSET __attribute__((section("sfrs"),address(0xBF82E058)));
extern volatile uint32_t        PMAENINV __attribute__((section("sfrs"),address(0xBF82E05C)));
#define PMSTAT PMSTAT
extern volatile uint32_t   PMSTAT __attribute__((section("sfrs"), address(0xBF82E060)));
typedef union {
  struct {
    uint32_t OB0E:1;
    uint32_t OB1E:1;
    uint32_t OB2E:1;
    uint32_t OB3E:1;
    uint32_t :2;
    uint32_t OBUF:1;
    uint32_t OBE:1;
    uint32_t IB0F:1;
    uint32_t IB1F:1;
    uint32_t IB2F:1;
    uint32_t IB3F:1;
    uint32_t :2;
    uint32_t IBOV:1;
    uint32_t IBF:1;
  };
  struct {
    uint32_t w:32;
  };
} __PMSTATbits_t;
extern volatile __PMSTATbits_t PMSTATbits __asm__ ("PMSTAT") __attribute__((section("sfrs"), address(0xBF82E060)));
extern volatile uint32_t        PMSTATCLR __attribute__((section("sfrs"),address(0xBF82E064)));
extern volatile uint32_t        PMSTATSET __attribute__((section("sfrs"),address(0xBF82E068)));
extern volatile uint32_t        PMSTATINV __attribute__((section("sfrs"),address(0xBF82E06C)));
#define PMWADDR PMWADDR
extern volatile uint32_t   PMWADDR __attribute__((section("sfrs"), address(0xBF82E070)));
typedef union {
  struct {
    uint32_t WADDR:24;
  };
  struct {
    uint32_t :14;
    uint32_t WCS:2;
    uint32_t :6;
    uint32_t WCSA:2;
  };
  struct {
    uint32_t :14;
    uint32_t WCS1:1;
    uint32_t WCS2:1;
    uint32_t :6;
    uint32_t WCS1A:1;
    uint32_t WCS2A:1;
  };
  struct {
    uint32_t w:32;
  };
  struct {
    uint32_t :14;
    uint32_t WADDR14:1;
    uint32_t WADDR15:1;
    uint32_t :6;
    uint32_t WADDR22:1;
    uint32_t WADDR23:1;
  };
} __PMWADDRbits_t;
extern volatile __PMWADDRbits_t PMWADDRbits __asm__ ("PMWADDR") __attribute__((section("sfrs"), address(0xBF82E070)));
extern volatile uint32_t        PMWADDRCLR __attribute__((section("sfrs"),address(0xBF82E074)));
extern volatile uint32_t        PMWADDRSET __attribute__((section("sfrs"),address(0xBF82E078)));
extern volatile uint32_t        PMWADDRINV __attribute__((section("sfrs"),address(0xBF82E07C)));
#define PMRADDR PMRADDR
extern volatile uint32_t   PMRADDR __attribute__((section("sfrs"), address(0xBF82E080)));
typedef union {
  struct {
    uint32_t RADDR:14;
    uint32_t RADDR14:1;
    uint32_t RADDR15:1;
  };
  struct {
    uint32_t :14;
    uint32_t RCS:2;
  };
  struct {
    uint32_t :14;
    uint32_t RCS1:1;
    uint32_t RCS2:1;
  };
  struct {
    uint32_t w:32;
  };
} __PMRADDRbits_t;
extern volatile __PMRADDRbits_t PMRADDRbits __asm__ ("PMRADDR") __attribute__((section("sfrs"), address(0xBF82E080)));
extern volatile uint32_t        PMRADDRCLR __attribute__((section("sfrs"),address(0xBF82E084)));
extern volatile uint32_t        PMRADDRSET __attribute__((section("sfrs"),address(0xBF82E088)));
extern volatile uint32_t        PMRADDRINV __attribute__((section("sfrs"),address(0xBF82E08C)));
#define PMRDIN PMRDIN
extern volatile uint32_t   PMRDIN __attribute__((section("sfrs"), address(0xBF82E090)));
typedef union {
  struct {
    uint32_t RDATAIN:32;
  };
  struct {
    uint32_t w:32;
  };
} __PMRDINbits_t;
extern volatile __PMRDINbits_t PMRDINbits __asm__ ("PMRDIN") __attribute__((section("sfrs"), address(0xBF82E090)));
extern volatile uint32_t        PMRDINCLR __attribute__((section("sfrs"),address(0xBF82E094)));
extern volatile uint32_t        PMRDINSET __attribute__((section("sfrs"),address(0xBF82E098)));
extern volatile uint32_t        PMRDININV __attribute__((section("sfrs"),address(0xBF82E09C)));
#define T1CON T1CON
extern volatile uint32_t   T1CON __attribute__((section("sfrs"), address(0xBF840000)));
typedef union {
  struct {
    uint32_t :1;
    uint32_t TCS:1;
    uint32_t TSYNC:1;
    uint32_t :1;
    uint32_t TCKPS:2;
    uint32_t :1;
    uint32_t TGATE:1;
    uint32_t :3;
    uint32_t TWIP:1;
    uint32_t TWDIS:1;
    uint32_t SIDL:1;
    uint32_t :1;
    uint32_t ON:1;
  };
  struct {
    uint32_t :4;
    uint32_t TCKPS0:1;
    uint32_t TCKPS1:1;
  };
  struct {
    uint32_t :13;
    uint32_t TSIDL:1;
    uint32_t :1;
    uint32_t TON:1;
  };
  struct {
    uint32_t w:32;
  };
} __T1CONbits_t;
extern volatile __T1CONbits_t T1CONbits __asm__ ("T1CON") __attribute__((section("sfrs"), address(0xBF840000)));
extern volatile uint32_t        T1CONCLR __attribute__((section("sfrs"),address(0xBF840004)));
extern volatile uint32_t        T1CONSET __attribute__((section("sfrs"),address(0xBF840008)));
extern volatile uint32_t        T1CONINV __attribute__((section("sfrs"),address(0xBF84000C)));
#define TMR1 TMR1
extern volatile uint32_t   TMR1 __attribute__((section("sfrs"), address(0xBF840010)));
extern volatile uint32_t        TMR1CLR __attribute__((section("sfrs"),address(0xBF840014)));
extern volatile uint32_t        TMR1SET __attribute__((section("sfrs"),address(0xBF840018)));
extern volatile uint32_t        TMR1INV __attribute__((section("sfrs"),address(0xBF84001C)));
#define PR1 PR1
extern volatile uint32_t   PR1 __attribute__((section("sfrs"), address(0xBF840020)));
extern volatile uint32_t        PR1CLR __attribute__((section("sfrs"),address(0xBF840024)));
extern volatile uint32_t        PR1SET __attribute__((section("sfrs"),address(0xBF840028)));
extern volatile uint32_t        PR1INV __attribute__((section("sfrs"),address(0xBF84002C)));
#define T2CON T2CON
extern volatile uint32_t   T2CON __attribute__((section("sfrs"), address(0xBF840200)));
typedef union {
  struct {
    uint32_t :1;
    uint32_t TCS:1;
    uint32_t :1;
    uint32_t T32:1;
    uint32_t TCKPS:3;
    uint32_t TGATE:1;
    uint32_t :5;
    uint32_t SIDL:1;
    uint32_t :1;
    uint32_t ON:1;
  };
  struct {
    uint32_t :4;
    uint32_t TCKPS0:1;
    uint32_t TCKPS1:1;
    uint32_t TCKPS2:1;
  };
  struct {
    uint32_t :13;
    uint32_t TSIDL:1;
    uint32_t :1;
    uint32_t TON:1;
  };
  struct {
    uint32_t w:32;
  };
} __T2CONbits_t;
extern volatile __T2CONbits_t T2CONbits __asm__ ("T2CON") __attribute__((section("sfrs"), address(0xBF840200)));
extern volatile uint32_t        T2CONCLR __attribute__((section("sfrs"),address(0xBF840204)));
extern volatile uint32_t        T2CONSET __attribute__((section("sfrs"),address(0xBF840208)));
extern volatile uint32_t        T2CONINV __attribute__((section("sfrs"),address(0xBF84020C)));
#define TMR2 TMR2
extern volatile uint32_t   TMR2 __attribute__((section("sfrs"), address(0xBF840210)));
extern volatile uint32_t        TMR2CLR __attribute__((section("sfrs"),address(0xBF840214)));
extern volatile uint32_t        TMR2SET __attribute__((section("sfrs"),address(0xBF840218)));
extern volatile uint32_t        TMR2INV __attribute__((section("sfrs"),address(0xBF84021C)));
#define PR2 PR2
extern volatile uint32_t   PR2 __attribute__((section("sfrs"), address(0xBF840220)));
extern volatile uint32_t        PR2CLR __attribute__((section("sfrs"),address(0xBF840224)));
extern volatile uint32_t        PR2SET __attribute__((section("sfrs"),address(0xBF840228)));
extern volatile uint32_t        PR2INV __attribute__((section("sfrs"),address(0xBF84022C)));
#define T3CON T3CON
extern volatile uint32_t   T3CON __attribute__((section("sfrs"), address(0xBF840400)));
typedef union {
  struct {
    uint32_t :1;
    uint32_t TCS:1;
    uint32_t :2;
    uint32_t TCKPS:3;
    uint32_t TGATE:1;
    uint32_t :5;
    uint32_t SIDL:1;
    uint32_t :1;
    uint32_t ON:1;
  };
  struct {
    uint32_t :4;
    uint32_t TCKPS0:1;
    uint32_t TCKPS1:1;
    uint32_t TCKPS2:1;
  };
  struct {
    uint32_t :13;
    uint32_t TSIDL:1;
    uint32_t :1;
    uint32_t TON:1;
  };
  struct {
    uint32_t w:32;
  };
} __T3CONbits_t;
extern volatile __T3CONbits_t T3CONbits __asm__ ("T3CON") __attribute__((section("sfrs"), address(0xBF840400)));
extern volatile uint32_t        T3CONCLR __attribute__((section("sfrs"),address(0xBF840404)));
extern volatile uint32_t        T3CONSET __attribute__((section("sfrs"),address(0xBF840408)));
extern volatile uint32_t        T3CONINV __attribute__((section("sfrs"),address(0xBF84040C)));
#define TMR3 TMR3
extern volatile uint32_t   TMR3 __attribute__((section("sfrs"), address(0xBF840410)));
extern volatile uint32_t        TMR3CLR __attribute__((section("sfrs"),address(0xBF840414)));
extern volatile uint32_t        TMR3SET __attribute__((section("sfrs"),address(0xBF840418)));
extern volatile uint32_t        TMR3INV __attribute__((section("sfrs"),address(0xBF84041C)));
#define PR3 PR3
extern volatile uint32_t   PR3 __attribute__((section("sfrs"), address(0xBF840420)));
extern volatile uint32_t        PR3CLR __attribute__((section("sfrs"),address(0xBF840424)));
extern volatile uint32_t        PR3SET __attribute__((section("sfrs"),address(0xBF840428)));
extern volatile uint32_t        PR3INV __attribute__((section("sfrs"),address(0xBF84042C)));
#define T4CON T4CON
extern volatile uint32_t   T4CON __attribute__((section("sfrs"), address(0xBF840600)));
typedef union {
  struct {
    uint32_t :1;
    uint32_t TCS:1;
    uint32_t :1;
    uint32_t T32:1;
    uint32_t TCKPS:3;
    uint32_t TGATE:1;
    uint32_t :5;
    uint32_t SIDL:1;
    uint32_t :1;
    uint32_t ON:1;
  };
  struct {
    uint32_t :4;
    uint32_t TCKPS0:1;
    uint32_t TCKPS1:1;
    uint32_t TCKPS2:1;
  };
  struct {
    uint32_t :13;
    uint32_t TSIDL:1;
    uint32_t :1;
    uint32_t TON:1;
  };
  struct {
    uint32_t w:32;
  };
} __T4CONbits_t;
extern volatile __T4CONbits_t T4CONbits __asm__ ("T4CON") __attribute__((section("sfrs"), address(0xBF840600)));
extern volatile uint32_t        T4CONCLR __attribute__((section("sfrs"),address(0xBF840604)));
extern volatile uint32_t        T4CONSET __attribute__((section("sfrs"),address(0xBF840608)));
extern volatile uint32_t        T4CONINV __attribute__((section("sfrs"),address(0xBF84060C)));
#define TMR4 TMR4
extern volatile uint32_t   TMR4 __attribute__((section("sfrs"), address(0xBF840610)));
extern volatile uint32_t        TMR4CLR __attribute__((section("sfrs"),address(0xBF840614)));
extern volatile uint32_t        TMR4SET __attribute__((section("sfrs"),address(0xBF840618)));
extern volatile uint32_t        TMR4INV __attribute__((section("sfrs"),address(0xBF84061C)));
#define PR4 PR4
extern volatile uint32_t   PR4 __attribute__((section("sfrs"), address(0xBF840620)));
extern volatile uint32_t        PR4CLR __attribute__((section("sfrs"),address(0xBF840624)));
extern volatile uint32_t        PR4SET __attribute__((section("sfrs"),address(0xBF840628)));
extern volatile uint32_t        PR4INV __attribute__((section("sfrs"),address(0xBF84062C)));
#define T5CON T5CON
extern volatile uint32_t   T5CON __attribute__((section("sfrs"), address(0xBF840800)));
typedef union {
  struct {
    uint32_t :1;
    uint32_t TCS:1;
    uint32_t :2;
    uint32_t TCKPS:3;
    uint32_t TGATE:1;
    uint32_t :5;
    uint32_t SIDL:1;
    uint32_t :1;
    uint32_t ON:1;
  };
  struct {
    uint32_t :4;
    uint32_t TCKPS0:1;
    uint32_t TCKPS1:1;
    uint32_t TCKPS2:1;
  };
  struct {
    uint32_t :13;
    uint32_t TSIDL:1;
    uint32_t :1;
    uint32_t TON:1;
  };
  struct {
    uint32_t w:32;
  };
} __T5CONbits_t;
extern volatile __T5CONbits_t T5CONbits __asm__ ("T5CON") __attribute__((section("sfrs"), address(0xBF840800)));
extern volatile uint32_t        T5CONCLR __attribute__((section("sfrs"),address(0xBF840804)));
extern volatile uint32_t        T5CONSET __attribute__((section("sfrs"),address(0xBF840808)));
extern volatile uint32_t        T5CONINV __attribute__((section("sfrs"),address(0xBF84080C)));
#define TMR5 TMR5
extern volatile uint32_t   TMR5 __attribute__((section("sfrs"), address(0xBF840810)));
extern volatile uint32_t        TMR5CLR __attribute__((section("sfrs"),address(0xBF840814)));
extern volatile uint32_t        TMR5SET __attribute__((section("sfrs"),address(0xBF840818)));
extern volatile uint32_t        TMR5INV __attribute__((section("sfrs"),address(0xBF84081C)));
#define PR5 PR5
extern volatile uint32_t   PR5 __attribute__((section("sfrs"), address(0xBF840820)));
extern volatile uint32_t        PR5CLR __attribute__((section("sfrs"),address(0xBF840824)));
extern volatile uint32_t        PR5SET __attribute__((section("sfrs"),address(0xBF840828)));
extern volatile uint32_t        PR5INV __attribute__((section("sfrs"),address(0xBF84082C)));
#define T6CON T6CON
extern volatile uint32_t   T6CON __attribute__((section("sfrs"), address(0xBF840A00)));
typedef union {
  struct {
    uint32_t :1;
    uint32_t TCS:1;
    uint32_t :1;
    uint32_t T32:1;
    uint32_t TCKPS:3;
    uint32_t TGATE:1;
    uint32_t :5;
    uint32_t SIDL:1;
    uint32_t :1;
    uint32_t ON:1;
  };
  struct {
    uint32_t :4;
    uint32_t TCKPS0:1;
    uint32_t TCKPS1:1;
    uint32_t TCKPS2:1;
  };
  struct {
    uint32_t :13;
    uint32_t TSIDL:1;
    uint32_t :1;
    uint32_t TON:1;
  };
  struct {
    uint32_t w:32;
  };
} __T6CONbits_t;
extern volatile __T6CONbits_t T6CONbits __asm__ ("T6CON") __attribute__((section("sfrs"), address(0xBF840A00)));
extern volatile uint32_t        T6CONCLR __attribute__((section("sfrs"),address(0xBF840A04)));
extern volatile uint32_t        T6CONSET __attribute__((section("sfrs"),address(0xBF840A08)));
extern volatile uint32_t        T6CONINV __attribute__((section("sfrs"),address(0xBF840A0C)));
#define TMR6 TMR6
extern volatile uint32_t   TMR6 __attribute__((section("sfrs"), address(0xBF840A10)));
extern volatile uint32_t        TMR6CLR __attribute__((section("sfrs"),address(0xBF840A14)));
extern volatile uint32_t        TMR6SET __attribute__((section("sfrs"),address(0xBF840A18)));
extern volatile uint32_t        TMR6INV __attribute__((section("sfrs"),address(0xBF840A1C)));
#define PR6 PR6
extern volatile uint32_t   PR6 __attribute__((section("sfrs"), address(0xBF840A20)));
extern volatile uint32_t        PR6CLR __attribute__((section("sfrs"),address(0xBF840A24)));
extern volatile uint32_t        PR6SET __attribute__((section("sfrs"),address(0xBF840A28)));
extern volatile uint32_t        PR6INV __attribute__((section("sfrs"),address(0xBF840A2C)));
#define T7CON T7CON
extern volatile uint32_t   T7CON __attribute__((section("sfrs"), address(0xBF840C00)));
typedef union {
  struct {
    uint32_t :1;
    uint32_t TCS:1;
    uint32_t :2;
    uint32_t TCKPS:3;
    uint32_t TGATE:1;
    uint32_t :5;
    uint32_t SIDL:1;
    uint32_t :1;
    uint32_t ON:1;
  };
  struct {
    uint32_t :4;
    uint32_t TCKPS0:1;
    uint32_t TCKPS1:1;
    uint32_t TCKPS2:1;
  };
  struct {
    uint32_t :13;
    uint32_t TSIDL:1;
    uint32_t :1;
    uint32_t TON:1;
  };
  struct {
    uint32_t w:32;
  };
} __T7CONbits_t;
extern volatile __T7CONbits_t T7CONbits __asm__ ("T7CON") __attribute__((section("sfrs"), address(0xBF840C00)));
extern volatile uint32_t        T7CONCLR __attribute__((section("sfrs"),address(0xBF840C04)));
extern volatile uint32_t        T7CONSET __attribute__((section("sfrs"),address(0xBF840C08)));
extern volatile uint32_t        T7CONINV __attribute__((section("sfrs"),address(0xBF840C0C)));
#define TMR7 TMR7
extern volatile uint32_t   TMR7 __attribute__((section("sfrs"), address(0xBF840C10)));
extern volatile uint32_t        TMR7CLR __attribute__((section("sfrs"),address(0xBF840C14)));
extern volatile uint32_t        TMR7SET __attribute__((section("sfrs"),address(0xBF840C18)));
extern volatile uint32_t        TMR7INV __attribute__((section("sfrs"),address(0xBF840C1C)));
#define PR7 PR7
extern volatile uint32_t   PR7 __attribute__((section("sfrs"), address(0xBF840C20)));
extern volatile uint32_t        PR7CLR __attribute__((section("sfrs"),address(0xBF840C24)));
extern volatile uint32_t        PR7SET __attribute__((section("sfrs"),address(0xBF840C28)));
extern volatile uint32_t        PR7INV __attribute__((section("sfrs"),address(0xBF840C2C)));
#define T8CON T8CON
extern volatile uint32_t   T8CON __attribute__((section("sfrs"), address(0xBF840E00)));
typedef union {
  struct {
    uint32_t :1;
    uint32_t TCS:1;
    uint32_t :1;
    uint32_t T32:1;
    uint32_t TCKPS:3;
    uint32_t TGATE:1;
    uint32_t :5;
    uint32_t SIDL:1;
    uint32_t :1;
    uint32_t ON:1;
  };
  struct {
    uint32_t :4;
    uint32_t TCKPS0:1;
    uint32_t TCKPS1:1;
    uint32_t TCKPS2:1;
  };
  struct {
    uint32_t :13;
    uint32_t TSIDL:1;
    uint32_t :1;
    uint32_t TON:1;
  };
  struct {
    uint32_t w:32;
  };
} __T8CONbits_t;
extern volatile __T8CONbits_t T8CONbits __asm__ ("T8CON") __attribute__((section("sfrs"), address(0xBF840E00)));
extern volatile uint32_t        T8CONCLR __attribute__((section("sfrs"),address(0xBF840E04)));
extern volatile uint32_t        T8CONSET __attribute__((section("sfrs"),address(0xBF840E08)));
extern volatile uint32_t        T8CONINV __attribute__((section("sfrs"),address(0xBF840E0C)));
#define TMR8 TMR8
extern volatile uint32_t   TMR8 __attribute__((section("sfrs"), address(0xBF840E10)));
extern volatile uint32_t        TMR8CLR __attribute__((section("sfrs"),address(0xBF840E14)));
extern volatile uint32_t        TMR8SET __attribute__((section("sfrs"),address(0xBF840E18)));
extern volatile uint32_t        TMR8INV __attribute__((section("sfrs"),address(0xBF840E1C)));
#define PR8 PR8
extern volatile uint32_t   PR8 __attribute__((section("sfrs"), address(0xBF840E20)));
extern volatile uint32_t        PR8CLR __attribute__((section("sfrs"),address(0xBF840E24)));
extern volatile uint32_t        PR8SET __attribute__((section("sfrs"),address(0xBF840E28)));
extern volatile uint32_t        PR8INV __attribute__((section("sfrs"),address(0xBF840E2C)));
#define T9CON T9CON
extern volatile uint32_t   T9CON __attribute__((section("sfrs"), address(0xBF841000)));
typedef union {
  struct {
    uint32_t :1;
    uint32_t TCS:1;
    uint32_t :2;
    uint32_t TCKPS:3;
    uint32_t TGATE:1;
    uint32_t :5;
    uint32_t SIDL:1;
    uint32_t :1;
    uint32_t ON:1;
  };
  struct {
    uint32_t :4;
    uint32_t TCKPS0:1;
    uint32_t TCKPS1:1;
    uint32_t TCKPS2:1;
  };
  struct {
    uint32_t :13;
    uint32_t TSIDL:1;
    uint32_t :1;
    uint32_t TON:1;
  };
  struct {
    uint32_t w:32;
  };
} __T9CONbits_t;
extern volatile __T9CONbits_t T9CONbits __asm__ ("T9CON") __attribute__((section("sfrs"), address(0xBF841000)));
extern volatile uint32_t        T9CONCLR __attribute__((section("sfrs"),address(0xBF841004)));
extern volatile uint32_t        T9CONSET __attribute__((section("sfrs"),address(0xBF841008)));
extern volatile uint32_t        T9CONINV __attribute__((section("sfrs"),address(0xBF84100C)));
#define TMR9 TMR9
extern volatile uint32_t   TMR9 __attribute__((section("sfrs"), address(0xBF841010)));
extern volatile uint32_t        TMR9CLR __attribute__((section("sfrs"),address(0xBF841014)));
extern volatile uint32_t        TMR9SET __attribute__((section("sfrs"),address(0xBF841018)));
extern volatile uint32_t        TMR9INV __attribute__((section("sfrs"),address(0xBF84101C)));
#define PR9 PR9
extern volatile uint32_t   PR9 __attribute__((section("sfrs"), address(0xBF841020)));
extern volatile uint32_t        PR9CLR __attribute__((section("sfrs"),address(0xBF841024)));
extern volatile uint32_t        PR9SET __attribute__((section("sfrs"),address(0xBF841028)));
extern volatile uint32_t        PR9INV __attribute__((section("sfrs"),address(0xBF84102C)));
#define IC1CON IC1CON
extern volatile uint32_t   IC1CON __attribute__((section("sfrs"), address(0xBF842000)));
typedef union {
  struct {
    uint32_t ICM:3;
    uint32_t ICBNE:1;
    uint32_t ICOV:1;
    uint32_t ICI:2;
    uint32_t ICTMR:1;
    uint32_t C32:1;
    uint32_t FEDGE:1;
    uint32_t :3;
    uint32_t SIDL:1;
    uint32_t :1;
    uint32_t ON:1;
  };
  struct {
    uint32_t ICM0:1;
    uint32_t ICM1:1;
    uint32_t ICM2:1;
    uint32_t :2;
    uint32_t ICI0:1;
    uint32_t ICI1:1;
  };
  struct {
    uint32_t :13;
    uint32_t ICSIDL:1;
  };
  struct {
    uint32_t w:32;
  };
} __IC1CONbits_t;
